import { MigrationInterface, QueryRunner } from 'typeorm';

export class Parties1607157603730 implements MigrationInterface {
  public async up(queryRunner: QueryRunner): Promise<void> {
    await queryRunner.query(`
        INSERT INTO "parties" ("id", "name", "display_name", "is_featured", "color") VALUES
        ('0', 'Не подкрепям никого', 'Не подкрепям никого', 't', NULL),
        ('1', 'Движение ЗАЕДНО за промяна (ПП БЪЛГАРСКА СОЦИАЛДЕМОКРАЦИЯ – ЕВРОЛЕВИЦА, ПП ЕВРОПЕЙСКА СИГУРНОСТ И ИНТЕГРАЦИЯ, ПП РОДОЛЮБИЕ 2000)', 'Заедно за промяна', 'f', NULL),
        ('2', 'ПП СВОБОДА', 'Свобода', 'f', NULL),
        ('3', 'Български национален съюз – НД', 'Български национален съюз – НД', 'f', NULL),
        ('4', 'БСП ЗА БЪЛГАРИЯ', 'БСП за България', 't', 'ED1C24'),
        ('5', 'ГЕРБ-СДС', 'ГЕРБ-СДС', 't', '0193CC'),
        ('6', 'ПП АТАКА', 'Атака', 'f', NULL),
        ('7', 'Движение за права и свободи - ДПС', 'ДПС', 't', 'EB1AC1'),
        ('8', 'ИЗПРАВИ СЕ! МУТРИ ВЪН!', 'Изправи се! Мутри вън!', 't', 'F7941D'),
        ('9', 'ПП МИР', 'МИР', 'f', NULL),
        ('10', 'БТР – БЪЛГАРИЯ НА ТРУДА И РАЗУМА', 'БТР', 'f', NULL),
        ('11', 'ВЪЗРАЖДАНЕ', 'Възраждане', 'f', NULL),
        ('12', 'ПП ПОДЕМ', 'Подем', 'f', NULL),
        ('13', 'БРИГАДА', 'Бригада', 'f', NULL),
        ('14', 'ПРЯКА ДЕМОКРАЦИЯ', 'Пряка демокрация', 'f', NULL),
        ('15', 'ГРАЖДАНСКА ПЛАТФОРМА БЪЛГАРСКО ЛЯТО', 'Българско лято', 'f', '87C4B0'),
        ('16', 'БЪЛГАРСКИТЕ ПАТРИОТИ – ВМРО, ВОЛЯ И НФСБ', 'Българските патриоти', 't', 'A933DC'),
        ('17', 'ЛЯВ СЪЮЗ ЗА ЧИСТА И СВЯТА РЕПУБЛИКА', 'Ляв съюз за чиста и свята република', 'f', NULL),
        ('18', 'ПП Партия на ЗЕЛЕНИТЕ', 'Партия на зелените', 'f', NULL),
        ('19', 'НАЦИОНАЛНО ОБЕДИНЕНИЕ НА ДЕСНИЦАТА (КОД, БЗНС, БДФ, СЕК)', 'Национално обединение на десницата', 'f', NULL),
        ('20', 'ПП ГЛАС НАРОДЕН', 'Глас народен', 'f', NULL),
        ('21', 'ПП РЕПУБЛИКАНЦИ ЗА БЪЛГАРИЯ', 'Републиканци за България', 'f', '808080'),
        ('22', 'ПП ИМА ТАКЪВ НАРОД', 'Има такъв народ', 't', 'FFC300'),
        ('23', 'ДЕМОКРАТИЧНА БЪЛГАРИЯ – ОБЕДИНЕНИЕ (ДА България, ДСБ, Зелено движение)', 'Демократична България', 't', '034A80');
      `);
  }

  public async down(queryRunner: QueryRunner): Promise<void> {
    queryRunner.query(`TRUNCATE TABLE "parties" RESTART IDENTITY CASCADE`);
  }
}
