import {MigrationInterface, QueryRunner} from 'typeorm';

export class Parties1607157603730 implements MigrationInterface {

    public async up(queryRunner: QueryRunner): Promise<void> {
      await queryRunner.query(`
        INSERT INTO "parties" ("id", "name", "display_name", "is_featured", "color") VALUES
        ('0', 'Не подкрепям никого', 'Не подкрепям никого', 'f', NULL),
        ('1', '1. ПП ВМРО – БЪЛГАРСКО НАЦИОНАЛНО ДВИЖЕНИЕ', '1. ВМРО', 't', '111111'),
        ('2', '2. КП „НИЕ, ГРАЖДАНИТЕ“', '2. Ние, Гражданите', 'f', NULL),
        ('3', '3. ПП „БЪЛГАРСКИ НАЦИОНАЛЕН СЪЮЗ „НОВА ДЕМОКРАЦИЯ“', '3. БНС Нова Демокрация', 'f', NULL),
        ('4', '4. КП „БСП за БЪЛГАРИЯ“', '4. БСП', 't', 'ED1C24'),
        ('5', '5. ПП „Възраждане“', '5. Възраждане', 't', '213C33'),
        ('6', '6. ПП „АБВ (Алтернатива за българско възраждане)“', '6. АБВ', 'f', NULL),
        ('7', '7. ПП „АТАКА“', '7. Атака', 'f', NULL),
        ('8', '8. ПП „КОНСЕРВАТИВНО ОБЕДИНЕНИЕ НА ДЕСНИЦАТА“', '8. КОД', 'f', NULL),
        ('9', '9. ПП „ДВИЖЕНИЕ ЗА ПРАВА И СВОБОДИ“', '9. ДПС', 't', '43291A'),
        ('10', '10. ПП „БЪЛГАРСКА ПРОГРЕСИВНА ЛИНИЯ“', '10. Българска Прогресивна Линия', 'f', NULL),
        ('11', '11. КП „ДЕМОКРАТИЧНА БЪЛГАРИЯ – ОБЕДИНЕНИЕ“', '11. Демократична България', 't', '034A80'),
        ('12', '12. ПП „Възраждане на Отечеството“', '12. Възраждане на Отечеството', 'f', NULL),
        ('13', '13. КП „ДВИЖЕНИЕ ЗАЕДНО ЗА ПРОМЯНА“', '13. Движение Заедно за Промяна', 'f', NULL),
        ('14', '14. ПП „БЪЛГАРСКО НАЦИОНАЛНО ОБЕДИНЕНИЕ – БНО“', '14. БНО', 'f', NULL),
        ('15', '15. ПП „НАЦИЯ“', '15. Нация', 'f', NULL),
        ('16', '16. ПП „МИР“', '16. МИР', 'f', NULL),
        ('17', '17. КП ГРАЖДАНИ ОТ ПРОТЕСТА', '17. Граждани от Протеста', 'f', NULL),
        ('18', '18. КП „ИЗПРАВИ СЕ! МУТРИ ВЪН!“', '18. Изправи се! Мутри Вън!', 't', 'F7941D'),
        ('19', '19. ПП „Глас Народен“', '19. Глас Народен', 'f', NULL),
        ('20', '20. ПП „Движение на непартийните кандидати“', '20. Движение на непартийните кандидати', 'f', NULL),
        ('21', '21. ПП „Републиканци за България“', '21. Републиканци за България', 't', '808080'),
        ('22', '22. ПП „ПРАВОТО“', '22. Правото', 'f', NULL),
        ('23', '23. ПП „Благоденствие-Обединение-Градивност“', '23. Благоденствие-Обединение-Градивност', 'f', NULL),
        ('24', '24. КП „ПАТРИОТИЧНА КОАЛИЦИЯ – ВОЛЯ И НФСБ“', '24. Патриотична коалиция - ВОЛЯ и НФСБ', 't', 'A933DC'),
        ('25', '25. ПП „Партия на ЗЕЛЕНИТЕ“', '25. Партия на Зелените', 'f', NULL),
        ('26', '26. ПП „ОБЩЕСТВО ЗА НОВА БЪЛГАРИЯ“', '26. Общество за Нова България', 'f', NULL),
        ('27', '27. ПП „БЪЛГАРСКИ СЪЮЗ ЗА ДИРЕКТНА ДЕМОКРАЦИЯ“', '27. Български съюз за директна демокрация', 'f', NULL),
        ('28', '28. KП ГЕРБ - СДС', '28. ГЕРБ - СДС', 't', '0193CC'),
        ('29', '29. ПП „ИМА ТАКЪВ НАРОД“', '29. Има Такъв Народ', 't', 'FFC300'),
        ('30', '30. ПП „ПРЯКА ДЕМОКРАЦИЯ“', '30. Пряка Демокрация', 'f', NULL);
      `);
    }

    public async down(queryRunner: QueryRunner): Promise<void> {
      queryRunner.query(`TRUNCATE TABLE "parties" RESTART IDENTITY CASCADE`);
    }
}
