import {MigrationInterface, QueryRunner} from 'typeorm';

export class Parties1607157603730 implements MigrationInterface {

    public async up(queryRunner: QueryRunner): Promise<void> {
      await queryRunner.query(`
        INSERT INTO parties (code, name, display_name) VALUES
        (1,'ПАТРИОТИ ЗА ВАЛЕРИ СИМЕОНОВ (НФСБ И СРЕДНА ЕВРОПЕЙСКА КЛАСА)', 'НФСБ'),
        (2,'ПЪТ НА МЛАДИТЕ (НДСВ и НОВОТО ВРЕМЕ)', 'НДСВ'),
        (3,'ПП ВМРО – БЪЛГАРСКО НАЦИОНАЛНО ДВИЖЕНИЕ', 'ВМРО'),
        (4,'ИК за Ваня Руменова Григорова-Ваня Руменова Григорова', 'Ваня Григорова'),
        (5,'Партия на ЗЕЛЕНИТЕ', 'Партия на Зелените'),
        (6,'ПП ВОЛТ', 'ВОЛТ'),
        (7,'ИК за Николай Нанков Ненчев-Николай Нанков Ненчев ', 'Николай Ненчев'),
        (8,'ИК за Венислава Пламенова Атанасова-Венислава Пламенова Атанасова', 'Венислава Атанасова'),
        (9,'ВЪЗХОД', 'ВЪЗХОД'),
        (10,'КП Коалиция за България', 'Коалиция за България'),
        (11,'ИК за Десислава Петрова Иванчева-Десислава Петрова Иванчева', 'Десислава Иванчева'),
        (12,'ПП ГЕРБ', 'ГЕРБ'),
        (13,'ДЕМОКРАТИЧНА БЪЛГАРИЯ – ОБЕДИНЕНИЕ (ДА България и ДСБ)', 'Демократична България'),
        (14,'АТАКА', 'Атака'),
        (15,'ИК за Минчо Христов Куминев-Минчо Христов Куминев', 'Минчо Куминев'),
        (16,'ПП ДОСТ', 'ДОСТ'),
        (17,'ПРЯКА ДЕМОКРАЦИЯ', 'Пряка Демокрация'),
        (18,'БСП ЗА БЪЛГАРИЯ', 'БСП'),
        (19,'ПП Глас Народен', 'Глас Народен'),
        (20,'Движение за права и свободи - ДПС', 'ДПС'),
        (21,'Движение ЗАЕДНО', 'Заедно'),
        (22,'БЪЛГАРСКО НАЦИОНАЛНО ОБЕДИНЕНИЕ', 'БНО'),
        (23,'ВОЛЯ – Българските Родолюбци', 'Воля'),
        (24,'Движение 21', 'Движение 21'),
        (25,'ИК за Христо Симеонов Симеонов-Христо Симеонов Симеонов', 'Христо Симеонов'),
        (26,'ПП „ДВИЖЕНИЕ ПРЕЗАРЕДИ БЪЛГАРИЯ“', 'Презареди България'),
        (27,'ПП „Възраждане“', 'Възраждане');
      `);
    }

    public async down(queryRunner: QueryRunner): Promise<void> {
      queryRunner.query(`TRUNCATE TABLE "parties" RESTART IDENTITY CASCADE`);
    }
}
