import {MigrationInterface, QueryRunner} from 'typeorm';

export class Organizations1607157753776 implements MigrationInterface {

    public async up(queryRunner: QueryRunner): Promise<void> {
      queryRunner.query(`
        insert into "organizations" ("name") values
        ('Демократична България'),
        ('Има Такъв Народ'),
        ('Изправи се! Мутри вън!'),
        ('БСП за България'),
        ('ГЕРБ - СДС'),
        ('ДПС'),
        ('ВМРО'),
        ('Воля и НФСБ'),
        ('Заедно за Промяна'),
        ('Ние, Гражданите'),
        ('Граждани от Протеста'),
        ('Републиканци за България'),
        ('Партия на Зелените'),
        ('Правото'),
        ('Възраждане'),
        ('МИР'),
        ('АБВ'),
        ('Българска Прогресивна Линия'),
        ('Глас Народен'),
        ('Пряка Демокрация'),
        ('БНС "Нова Демокрация"'),
        ('КОД'),
        ('АТАКА'),
        ('Възраждане на Отечеството'),
        ('БНО'),
        ('Благоденствие-Обединение-Градивност'),
        ('Общество за Нова България'),
        ('Движение на непартийните кандидати'),
        ('Български Съюз за Директна Демокрация'),
        ('Нация'),
        ('Член на комисия'),
        ('Организацията за Сигурност и Сътрудничество в Европа, Бюро за Демократични Избори и Права на Човека (ОССЕ/БДИПЧ)'),
        ('Парламентарната Асамблея на Организацията за Черноморско Икономическо Сътрудничество (ПАЧИС)'),
        ('Парламентарната Асамблея на Съвета на Европа (ПАСЕ)'),
        ('Парламентарната Асамблея на Организацията за Сигурност и Сътрудничество в Европа (ПАОССЕ)'),
        ('Институт за Социална Интеграция'),
        ('Федерация на Независимите Студентски Дружества'),
        ('Зона за Трансатлантически Просперитет – Наблюдателна Мисия, България'),
        ('Българско Сдружение за Честни Избори и Граждански Права – Пловдив'),
        ('Асоциация Прозрачност Без Граници'),
        ('Гражданска Инициатива за Свободни и Демократични Избори (ГИСДИ)'),
        ('Съюз на Офицерите и Сержантите От Запаса и Резерва'),
        ('Родопско Сърце'),
        ('Български Хелзинкски Комитет'),
        ('Институт за Развитие на Публичната Среда'),
        ('Звено за Развитие на Гражданското Общество'),
        ('Нова Алтернатива'),
        ('Младежи за Балканите'),
        ('Сдружение на Роверите'),
        ('Сдружение Демокрация и Законност'),
        ('Сдружение Институт за Политики и Развитие'),
        ('Бъдеще за Северозападна България'),
        ('Достойнството на Един Народ - ДЕН'),
        ('Сдружение Гражданско Движение за Равноправие'),
        ('Гражданска Мрежа – Кюстендил'),
        ('Боец – България Обединена С Една Цел'),
        ('Аз Обичам Пловдив');
      `);
    }

    public async down(queryRunner: QueryRunner): Promise<void> {
      queryRunner.query(`TRUNCATE TABLE "organizations" RESTART IDENTITY CASCADE`);
    }

}
