import {MigrationInterface, QueryRunner} from 'typeorm';

export class Organizations1607157753776 implements MigrationInterface {

    public async up(queryRunner: QueryRunner): Promise<void> {
      queryRunner.query(`
        insert into "organizations" ("name", "type") values
        ('Демократична България', 'party'),
        ('Има Такъв Народ', 'party'),
        ('Изправи се! Мутри вън!', 'party'),
        ('БСП за България', 'party'),
        ('ГЕРБ - СДС', 'party'),
        ('ДПС', 'party'),
        ('ВМРО', 'party'),
        ('Воля и НФСБ', 'party'),
        ('Заедно за Промяна', 'party'),
        ('Ние, Гражданите', 'party'),
        ('Граждани от Протеста', 'party'),
        ('Републиканци за България', 'party'),
        ('Партия на Зелените', 'party'),
        ('Правото', 'party'),
        ('Възраждане', 'party'),
        ('МИР', 'party'),
        ('АБВ', 'party'),
        ('Българска Прогресивна Линия', 'party'),
        ('Глас Народен', 'party'),
        ('Пряка Демокрация', 'party'),
        ('БНС "Нова Демокрация"', 'party'),
        ('КОД', 'party'),
        ('АТАКА', 'party'),
        ('Възраждане на Отечеството', 'party'),
        ('БНО', 'party'),
        ('Благоденствие-Обединение-Градивност', 'party'),
        ('Общество за Нова България', 'party'),
        ('Движение на непартийните кандидати', 'party'),
        ('Български Съюз за Директна Демокрация', 'party'),
        ('Нация', 'party'),
        ('Член на комисия', 'commission'),
        ('ОССЕ/БДИПЧ', 'watchers'),
        ('ПАЧИС', 'watchers'),
        ('ПАСЕ', 'watchers'),
        ('ПАОССЕ', 'watchers'),
        ('Институт за Социална Интеграция', 'watchers'),
        ('Федерация на Независимите Студентски Дружества', 'watchers'),
        ('Зона за Трансатлантически Просперитет', 'watchers'),
        ('Българско Сдружение за Честни Избори и Граждански Права – Пловдив', 'watchers'),
        ('Асоциация Прозрачност Без Граници', 'watchers'),
        ('ГИСДИ', 'watchers'),
        ('Съюз на Офицерите и Сержантите От Запаса и Резерва', 'watchers'),
        ('Родопско Сърце', 'watchers'),
        ('Български Хелзинкски Комитет', 'watchers'),
        ('Институт за Развитие на Публичната Среда', 'watchers'),
        ('Звено за Развитие на Гражданското Общество', 'watchers'),
        ('Нова Алтернатива', 'watchers'),
        ('Младежи за Балканите', 'watchers'),
        ('Сдружение на Роверите', 'watchers'),
        ('Сдружение Демокрация и Законност', 'watchers'),
        ('Сдружение Институт за Политики и Развитие', 'watchers'),
        ('Бъдеще за Северозападна България', 'watchers'),
        ('Достойнството на Един Народ - ДЕН', 'watchers'),
        ('Сдружение Гражданско Движение за Равноправие', 'watchers'),
        ('Гражданска Мрежа – Кюстендил', 'watchers'),
        ('Боец – България Обединена С Една Цел', 'watchers'),
        ('Аз Обичам Пловдив', 'watchers');
      `);
    }

    public async down(queryRunner: QueryRunner): Promise<void> {
      queryRunner.query(`TRUNCATE TABLE "organizations" RESTART IDENTITY CASCADE`);
    }

}
